#+DATE: <2015-02-01 Sun>
#+TITLE: Monitor Object Pattern
#+AUTHOR: Guowei Lv
#+OPTIONS: texht:t
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LaTeX_HEADER: \usemintedstyle{emacs}
#+LATEX_HEADER_EXTRA:

* How to run
Press =C-c C-c= on the code block below.

#+BEGIN_SRC elisp :exports none
;; tangle the source code
(org-babel-tangle)
;; export to pdf
(org-latex-export-to-pdf)
;; build
(shell-command-to-string "gradle jar")
#+END_SRC

#+RESULTS:
: :compileJava UP-TO-DATE
: :processResources UP-TO-DATE
: :classes UP-TO-DATE
: :jar UP-TO-DATE
: 
: BUILD SUCCESSFUL
: 
: Total time: 3.167 secs
